#!/bin/bash

declare -a characters=("!" "\"" "#" "$" "%" "&" "'" "(" ")" "*" "+" "," "-" "." "/" "0" "1" "2" "3" "4" "5" "6" "7" "8" "9" ":" ";" "<" "=" ">" "?" "@" "A" "B" "C" "D" "E" "F" "G" "H" "I" "J" "K" "L" "M" "N" "O" "P" "Q" "R" "S" "T" "U" "V" "W" "X" "Y" "Z" "[" "\\" "]" "^" "_" "\`" "a" "b" "c" "d" "e" "f" "g" "h" "i" "j" "k" "l" "m" "n" "o" "p" "q" "r" "s" "t" "u" "v" "w" "x" "y" "z" "{" "|" "}" "~" "Ä" "Å" "Ç" "É" "Ñ" "Ö" "Ü" "á" "à" "â" "ä" "ã" "å" "ç" "é" "è" "ê" "ë" "í" "ì" "î" "ï" "ñ" "ó" "ò" "ô" "ö" "õ" "ú" "ù" "û" "ü" "†" "°" "¢" "£" "§" "•" "¶" "ß" "®" "©" "™" "´" "¨" "≠" "Æ" "Ø" "∞" "±" "≤" "≥" "¥" "µ" "∂" "∑" "∏" "π" "∫" "ª" "º" "Ω" "æ" "ø" "¿" "¡" "¬" "√" "ƒ" "≈" "∆" "«" "»" "…" "À" "Ã" "Õ" "Œ" "œ" "–" "—" "“" "”" "‘" "’" "÷" "◊" "ÿ" "Ÿ" "⁄" "€" "‹" "›" "ﬁ" "ﬂ" "‡" "·" "‚" "„" "‰" "Â" "Ê" "Á" "Ë" "È" "Í" "Î" "Ï" "Ì" "Ó" "Ô" "Ò" "Ú" "Û" "Ù" "ı" "ˆ" "˜" "¯" "˘" "˙" "˚" "¸" "˝" "˛" "ˇ")

font_file="${1:-./Verdana.ttf}"
binary="${2:-cargo run --}"
file_name="${font_file##*/}"
base_name="${file_name%.*}"

for i in "${!characters[@]}"
do
    "${binary}" "${font_file}" "${characters[$i]}" ./images/"$base_name"/"$i".bmp
done
